In [1]:
import pandas as pd

### Pandas
1. Creation (Series/DataFrame -> List,tuple,dictionary,numpyarray)
2. Data Accessing/Management
3. Logical Indexing
4. Attributes (shape, size, dtype, values, index, columns)
5. Viewing (head,tail,sample)
6. Statistical Functions (sum,max,min,mean,median,quantile,var,corr,describe)
7. Data Merging (merge,concate)
8. String Functions
9. Function Application
10. Data Grouping / Aggregation
11. Missing Data Problem
12. File Handling
13. Date/Time Functionality
14. Utility Functions (renaming/transformation)
15. Graphical Visualization

In [2]:
{'name':['akshita','aakash','aaryan','anamika'],'age':[19,28,20,21],'salary':[20000,60000,20000,16000]}

{'name': ['akshita', 'aakash', 'aaryan', 'anamika'],
 'age': [19, 28, 20, 21],
 'salary': [20000, 60000, 20000, 16000]}

In [3]:
df = pd.DataFrame({'name':['akshita','aakash','aaryan','anamika'],'age':[19,28,20,21],'salary':[20000,60000,20000,16000]})
df

      name  age  salary
0  akshita   19   20000
1   aakash   28   60000
2   aaryan   20   20000
3  anamika   21   16000

In [5]:
s = pd.Series({'name':['akshita','aakash','aaryan','anamika'],'age':[19,28,20,21],'salary':[20000,60000,20000,16000]})
s

name      [akshita, aakash, aaryan, anamika]
age                         [19, 28, 20, 21]
salary          [20000, 60000, 20000, 16000]
dtype: object

In [6]:
df['name']

0    akshita
1     aakash
2     aaryan
3    anamika
Name: name, dtype: object

In [34]:
df['age']

0    19
1    28
2    20
3    21
Name: age, dtype: int64

In [7]:
df[['name','age']]

      name  age
0  akshita   19
1   aakash   28
2   aaryan   20
3  anamika   21

In [8]:
df[['name']]

      name
0  akshita
1   aakash
2   aaryan
3  anamika

In [9]:
s

name      [akshita, aakash, aaryan, anamika]
age                         [19, 28, 20, 21]
salary          [20000, 60000, 20000, 16000]
dtype: object

In [10]:
s['name']

['akshita', 'aakash', 'aaryan', 'anamika']

In [11]:
s.index

Index(['name', 'age', 'salary'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
df.columns

Index(['name', 'age', 'salary'], dtype='object')

In [15]:
df1 = pd.DataFrame([[3,'nice',1999],[8,'woo',1998],[6,'go',2001]], index=['a','b','c'],columns=['rank','word','year'])
df1

   rank  word  year
a     3  nice  1999
b     8   woo  1998
c     6    go  2001

In [19]:
df1.columns

Index(['rank', 'word', 'year'], dtype='object')

In [20]:
df1.columns[0]

'rank'

In [17]:
df1.index

Index(['a', 'b', 'c'], dtype='object')

In [23]:
# df1.loc[0] # this doesn't work

In [24]:
list('abcde')

['a', 'b', 'c', 'd', 'e']

In [35]:
s1 = pd.Series([5,7,3,7,3],index=list('abcde'), name='MeraName')
s1

a    5
b    7
c    3
d    7
e    3
Name: MeraName, dtype: int64

In [26]:
s1['a']

5

In [27]:
s1[0]

5

In [28]:
s1.values

array([5, 7, 3, 7, 3], dtype=int64)

In [29]:
s2 = pd.Series([5,7,3,7,3],index=[4,56,2,5,3])
s2

4     5
56    7
2     3
5     7
3     3
dtype: int64

In [32]:
s2.values[0]

5

In [33]:
s2.values.tolist()

[5, 7, 3, 7, 3]

##### Logical Indexing

In [36]:
df

      name  age  salary
0  akshita   19   20000
1   aakash   28   60000
2   aaryan   20   20000
3  anamika   21   16000

Que: People (Names) whos salary equal to 20K

In [38]:
df['name']

0    akshita
1     aakash
2     aaryan
3    anamika
Name: name, dtype: object

In [39]:
df['salary']

0    20000
1    60000
2    20000
3    16000
Name: salary, dtype: int64

In [40]:
df['salary'] == 20000

0     True
1    False
2     True
3    False
Name: salary, dtype: bool

In [41]:
df['name'][0]

'akshita'

In [42]:
df['name'][0:3]

0    akshita
1     aakash
2     aaryan
Name: name, dtype: object

In [45]:
df['name'][[True,False,True,True]]

0    akshita
2     aaryan
3    anamika
Name: name, dtype: object

In [46]:
df['name'][[0,3]]

0    akshita
3    anamika
Name: name, dtype: object

In [49]:
df['name'][df['salary']==20000]

0    akshita
2     aaryan
Name: name, dtype: object

In [51]:
df['name'][df['salary']==20000].values.tolist()

['akshita', 'aaryan']

In [52]:
df

      name  age  salary
0  akshita   19   20000
1   aakash   28   60000
2   aaryan   20   20000
3  anamika   21   16000

Que: how many people are having age above 20

In [54]:
sum(df['age']>20)

2

In [55]:
(df['age']>20).count()

4

In [56]:
df['age']>20

0    False
1     True
2    False
3     True
Name: age, dtype: bool

Food/Travel/Books/Programming/TVshows/sports/dance/songs/

In [57]:
food = pd.DataFrame({
    'name':['pizza','dosa','mirchi bada','paav bhaji','burger','dhokla','chhola bhathura','manchurian','momos','noodles','pani puri','chilly paneer','khoya paneer','honey chilly potato'],
    'cuisine':['italian','indian','indian','indian','german','indian','indian','chinese','chinese','chinese','indian','indian','indian','indo chinese'],
    'price':[120,60,20,50,40,100,70,140,40,60,30,130,140,160],
    'restaurant':['pizza hut','anna','anand ji','anand ji', 'burger singh','gujju da dhabha', 'anand ji','chinchen','chinchen','chinchen','anand ji','gujju da dhabha','gujju da dhabha','chinchen'],
    'offer':[10,0,5,5,30,10,30,10,0,0,0,30,30,50]
})
food

                   name       cuisine  price       restaurant  offer
0                 pizza       italian    120        pizza hut     10
1                  dosa        indian     60             anna      0
2           mirchi bada        indian     20         anand ji      5
3            paav bhaji        indian     50         anand ji      5
4                burger        german     40     burger singh     30
5                dhokla        indian    100  gujju da dhabha     10
6       chhola bhathura        indian     70         anand ji     30
7            manchurian       chinese    140         chinchen     10
8                 momos       chinese     40         chinchen      0
9               noodles       chinese     60         chinchen      0
10            pani puri        indian     30         anand ji      0
11        chilly paneer        indian    130  gujju da dhabha     30
12         khoya paneer        indian    140  gujju da dhabha     30
13  honey chilly potato  indo chinese    160         chinchen     50

que 1: find the costliest food (name)
que 2: find the cheapest indian food
que 3: what is avg price of chinese food
que 4: cuisine of cheapest food
que 5: avg price of food at anand ji's restaurant
que 6: top 2 restaurants with number of varieties in food
que 7: which resturant is offering highest avg discount

In [62]:
# que 1
food['name'][food['price'] == food['price'].max()].values.tolist()

['honey chilly potato']

In [81]:
food['name'][food['price'].idxmax()]

'honey chilly potato'

In [65]:
food[['name','price']][food['price'] == food['price'].max()].values

array([['honey chilly potato', 160]], dtype=object)

In [67]:
# que 2
indian = food[food['cuisine']=='indian']
indian

               name cuisine  price       restaurant  offer
1              dosa  indian     60             anna      0
2       mirchi bada  indian     20         anand ji      5
3        paav bhaji  indian     50         anand ji      5
5            dhokla  indian    100  gujju da dhabha     10
6   chhola bhathura  indian     70         anand ji     30
10        pani puri  indian     30         anand ji      0
11    chilly paneer  indian    130  gujju da dhabha     30
12     khoya paneer  indian    140  gujju da dhabha     30

In [69]:
indian['name'][indian['price']==indian['price'].min()].values

array(['mirchi bada'], dtype=object)

In [74]:
food['name'][food[food['cuisine']=='indian']['price'].idxmin()]

'mirchi bada'

In [75]:
# que 3
food['price'][food['cuisine']=='chinese'].mean()

80.0

In [80]:
# que 4
food['cuisine'][food['price']==food['price'].min()].values

array(['indian'], dtype=object)

In [78]:
food['cuisine'][food['price'].idxmin()]

'indian'

In [82]:
# que 5
food['price'][food['restaurant'] == 'anand ji'].mean()

42.5

In [84]:
# que 6
food['restaurant'].value_counts().head(2)

chinchen    4
anand ji    4
Name: restaurant, dtype: int64

In [85]:
food['restaurant'].value_counts().head(2).index

Index(['chinchen', 'anand ji'], dtype='object')

In [86]:
food

                   name       cuisine  price       restaurant  offer
0                 pizza       italian    120        pizza hut     10
1                  dosa        indian     60             anna      0
2           mirchi bada        indian     20         anand ji      5
3            paav bhaji        indian     50         anand ji      5
4                burger        german     40     burger singh     30
5                dhokla        indian    100  gujju da dhabha     10
6       chhola bhathura        indian     70         anand ji     30
7            manchurian       chinese    140         chinchen     10
8                 momos       chinese     40         chinchen      0
9               noodles       chinese     60         chinchen      0
10            pani puri        indian     30         anand ji      0
11        chilly paneer        indian    130  gujju da dhabha     30
12         khoya paneer        indian    140  gujju da dhabha     30
13  honey chilly potato  indo chinese    160         chinchen     50

In [89]:
offers = []
ress = []
for res in food['restaurant'].unique():
    offers.append(food['offer'][food['restaurant']==res].mean())
    ress.append(res)

In [90]:
offers

[10.0, 0.0, 10.0, 30.0, 23.333333333333332, 15.0]

In [91]:
ress

['pizza hut',
 'anna',
 'anand ji',
 'burger singh',
 'gujju da dhabha',
 'chinchen']

In [92]:
offer = pd.DataFrame({'off':offers,'rest':ress})
offer

         off             rest
0  10.000000        pizza hut
1   0.000000             anna
2  10.000000         anand ji
3  30.000000     burger singh
4  23.333333  gujju da dhabha
5  15.000000         chinchen

In [93]:
offer['rest'][offer['off'].idxmax()]

'burger singh'